Module 1 Task : 
Your task is to take a look at the following datasets provided by Sprocket Central Pty Ltd and identify all data quality   issues. 
Once you've had a look at these datasets, draft an email to the client identifying all data quality issues.

In [ ]:
#from pandas_profiling import ProfileReport
#profile = ProfileReport(Transactions, title='Pandas Profiling Report', explorative=True)
#profile.to_widgets()
#profile.to_file("transactions.html")

In [6]:
#pip install openpyxl
from openpyxl import load_workbook
workbook=load_workbook(filename="KPMG_VI_New_raw_data_update_final (1).xlsx")
workbook.sheetnames

['Title Sheet',
 'Transactions',
 'NewCustomerList',
 'CustomerDemographic',
 'CustomerAddress']

In [2]:
import pandas as pd

In [22]:
#Reading the sheet "Transactions"
Transactions=pd.read_excel(open('KPMG_VI_New_raw_data_update_final (1).xlsx', 'rb'),
              sheet_name='Transactions')

In [3]:
#Reading the sheet "NewCustomerList"
NewCustomerList=pd.read_excel(open('KPMG_VI_New_raw_data_update_final (1).xlsx', 'rb'),
              sheet_name='NewCustomerList')

In [24]:
#Reading the sheet "CustomerDemographic"
CustomerDemographic=pd.read_excel(open('KPMG_VI_New_raw_data_update_final (1).xlsx', 'rb'),
              sheet_name='CustomerDemographic')

In [25]:
#Reading the sheet "CustomerAddress"
CustomerAddress=pd.read_excel(open('KPMG_VI_New_raw_data_update_final (1).xlsx', 'rb'),
              sheet_name='CustomerAddress')

Lets view all the data in four sheets at once

In [26]:
Transactions.head(5)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,41245.0
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701.0
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361.0
3,4,88,3135,2017-08-31,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,36145.0
4,5,78,787,2017-10-01,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,42226.0

In [27]:
NewCustomerList.head(5)

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,...,QLD,Australia,6,0.71,0.8875,1.109375,0.942969,1,1,1.718750
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,...,NSW,Australia,11,0.51,0.5100,0.637500,0.541875,1,1,1.718750
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,...,VIC,Australia,5,1.05,1.0500,1.050000,1.050000,1,1,1.718750
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,...,QLD,Australia,1,0.78,0.9750,0.975000,0.975000,4,4,1.703125
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,...,NSW,Australia,9,0.56,0.5600,0.700000,0.700000,4,4,1.703125

In [17]:
CustomerDemographic.head(5)

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,2018-02-01 00:00:00,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,() { _; } >_[$($())] { touch /tmp/blns.shellsh...,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8.0

In [28]:
CustomerAddress.head(5)

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

# 1. Working Only On Transactions Data

In [4]:
Transactions.head(5)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,41245.0
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701.0
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361.0
3,4,88,3135,2017-08-31,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,36145.0
4,5,78,787,2017-10-01,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,42226.0

From the snapshot of the data i can say that, The last column product_first_sold_date and the observations wont match each other.

i also searched in the rest of the sheets is there any related data for the product_first_sold_date, But found none

I can Fill all the observations of "product_first_sold_date" with the "transaction_date" of the same datset(Transactions)
But Keeping two columns of same observations or values is not a good idea, it  Serves No purpose.

In [63]:
Transactions.tail(5)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
19995,19996,51,1018,2017-06-24,1.0,Approved,OHM Cycles,Standard,high,medium,2005.66,1203.40,37823.0
19996,19997,41,127,2017-11-09,1.0,Approved,Solex,Road,medium,medium,416.98,312.74,35560.0
19997,19998,87,2284,2017-04-14,1.0,Approved,OHM Cycles,Standard,medium,medium,1636.90,44.71,40410.0
19998,19999,6,2764,2017-07-03,0.0,Approved,OHM Cycles,Standard,high,medium,227.88,136.73,38216.0
19999,20000,11,1144,2017-09-22,1.0,Approved,Trek Bicycles,Standard,medium,small,1775.81,1580.47,36334.0

#Lets Understand the Features:

1.List_Price:
The list price is the stated value for which something is offered for sale through a particular channel such as a showroom, a retail store, a catalog or a retail, wholesale or distributor website.
List price is usually the highest price a consumer will be charged at retail or online except in the case of low supply, high demand, added value or seller inflation.

2.Standard_cost:
A standard cost is an estimated expense that normally occurs during the production of a product or performance of a service. In other words, 
this is theoretically the amount of money a company will have to spend to produce a product or perform a service under normal conditions.

3.Product_First_Sold_Date:
Date of First Sale means the time at which Licensed Product, or Licensed Services is/are transferred by Company to a third party for consideration
Which SHOULD be in DATE and TIME, BUT HERE ITS NOT !!!

In [37]:
#20000 rows and 13 columns
Transactions.shape

(20000, 13)

In [30]:
#columns names
Transactions.columns

Index(['transaction_id', 'product_id', 'customer_id', 'transaction_date',
       'online_order', 'order_status', 'brand', 'product_line',
       'product_class', 'product_size', 'list_price', 'standard_cost',
       'product_first_sold_date'],
      dtype='object')

In [29]:
#Datatypes
Transactions.dtypes

transaction_id                      int64
product_id                          int64
customer_id                         int64
transaction_date           datetime64[ns]
online_order                      float64
order_status                       object
brand                              object
product_line                       object
product_class                      object
product_size                       object
list_price                        float64
standard_cost                     float64
product_first_sold_date           float64
dtype: object

In [36]:
Transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
transaction_id             20000 non-null int64
product_id                 20000 non-null int64
customer_id                20000 non-null int64
transaction_date           20000 non-null datetime64[ns]
online_order               19640 non-null float64
order_status               20000 non-null object
brand                      19803 non-null object
product_line               19803 non-null object
product_class              19803 non-null object
product_size               19803 non-null object
list_price                 20000 non-null float64
standard_cost              19803 non-null float64
product_first_sold_date    19803 non-null float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB

In [30]:
Transactions.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
transaction_id,20000.0,10000.500000,5773.647028,1.00,5000.75,10000.50,15000.25,20000.00
product_id,20000.0,45.364650,30.753590,0.00,18.00,44.00,72.00,100.00
customer_id,20000.0,1738.246050,1011.951046,1.00,857.75,1736.00,2613.00,5034.00
online_order,19640.0,0.500458,0.500013,0.00,0.00,1.00,1.00,1.00
list_price,20000.0,1107.829449,582.825242,12.01,575.27,1163.89,1635.30,2091.47
standard_cost,19803.0,556.046951,405.955660,7.21,215.14,507.58,795.10,1759.85
product_first_sold_date,19803.0,38199.776549,2875.201110,33259.00,35667.00,38216.00,40672.00,42710.00

In [31]:
#Explore the data further more.
Transactions.order_status.unique()

array(['Approved', 'Cancelled'], dtype=object)

In [32]:
Transactions.brand.unique() 
#Company selling total 6 types of Brands

array(['Solex', 'Trek Bicycles', 'OHM Cycles', 'Norco Bicycles',
       'Giant Bicycles', 'WeareA2B', nan], dtype=object)

In [33]:
Transactions.product_line.unique() 
#Company selling 4 types of different products

array(['Standard', 'Road', 'Mountain', 'Touring', nan], dtype=object)

In [34]:
Transactions.product_class.unique()
#Company selling 3 types of different classes, It may be based on the price range, Lets look into that later

array(['medium', 'low', 'high', nan], dtype=object)

In [35]:
Transactions.product_size.unique()
#Company selling 3 types of product based on sizes

array(['medium', 'large', 'small', nan], dtype=object)

In [45]:
#Lets check some of the important attributes::
def is_unique(s):
    a= s.to_numpy()
    return (a[0] == a[1:].all())
is_unique(Transactions['transaction_id']) 
#which should be unique, as per the business rule.

True

In [46]:
def is_unique(s):
    a= s.to_numpy()
    return (a[0] == a[1:].all())
is_unique(Transactions['customer_id'])
#There is a chances of same customer buying multiple times so its ok to be a non unique

False

In [49]:
def is_unique(s):
    a= s.to_numpy()
    return (a[0] == a[1:].all())
is_unique(Transactions['online_order'])
#which should be unique, as per the business role and our code shows thats its unique

True

In [64]:
Transactions['order_status'].value_counts()

Approved     19821
Cancelled      179
Name: order_status, dtype: int64

In [65]:
Transactions['online_order'].value_counts() 
#Looks like, Company balancing online and offline sales very well.

1.0    9829
0.0    9811
Name: online_order, dtype: int64

In [66]:
Transactions['brand'].value_counts()

Solex             4253
Giant Bicycles    3312
WeareA2B          3295
OHM Cycles        3043
Trek Bicycles     2990
Norco Bicycles    2910
Name: brand, dtype: int64

In [69]:
Transactions['product_line'].value_counts()

Standard    14176
Road         3970
Touring      1234
Mountain      423
Name: product_line, dtype: int64

In [70]:
Transactions['product_class'].value_counts()

medium    13826
high       3013
low        2964
Name: product_class, dtype: int64

In [71]:
Transactions['product_size'].value_counts()

medium    12990
large      3976
small      2837
Name: product_size, dtype: int64

# Exploring Missing Values

In [36]:
#Number of NA values from each column(or Attributes or features)
Transactions.isna().sum()
# we have seen earlier in 20000rows we can easily drop 200 rows which shows "NA" or 
#I may fill those "NA" values with the help of pandas
#Lets see that in further steps.

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [38]:
#Lets findout the percentage of "NA" values contributed by each columns.
for x in Transactions.columns:
    print("Total % Null value in "+x+" - ",Transactions[x].isna().sum()/len(Transactions)*100)
    print()

Total % Null value in transaction_id -  0.0

Total % Null value in product_id -  0.0

Total % Null value in customer_id -  0.0

Total % Null value in transaction_date -  0.0

Total % Null value in online_order -  1.7999999999999998

Total % Null value in order_status -  0.0

Total % Null value in brand -  0.985

Total % Null value in product_line -  0.985

Total % Null value in product_class -  0.985

Total % Null value in product_size -  0.985

Total % Null value in list_price -  0.0

Total % Null value in standard_cost -  0.985

Total % Null value in product_first_sold_date -  0.985

Greater number of Null values are from the online_order column i.e 1.8% , 
360 counts or 1.8% of orders are not mentioned either it is ordered from online or through offline.
Which looks Suspecious.

# Checking For Duplicate Values

In [62]:
duplicates = Transactions.duplicated()
Transactions[duplicates].sum()

#No duplicates values are observed

transaction_id             0.0
product_id                 0.0
customer_id                0.0
transaction_date           0.0
online_order               0.0
order_status               0.0
brand                      0.0
product_line               0.0
product_class              0.0
product_size               0.0
list_price                 0.0
standard_cost              0.0
product_first_sold_date    0.0
dtype: float64

# Lets Fill The Missing Values

In [79]:
#Except Standard_cost and Product_first_sold_date   
#Lets fill the rest of the Attributes missing values with Pandas Forward Fill.
tan = Transactions

In [80]:
tan.isna().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [81]:
tan = tan[['online_order','brand','product_line','product_class','product_size']].ffill()

In [82]:
tan.isna().sum()
#tan type :DataFrame

online_order     0
brand            0
product_line     0
product_class    0
product_size     0
dtype: int64

In [84]:
Stand_cost_mean=Transactions['standard_cost'].mean()

In [92]:
tan_2 = Transactions['standard_cost'].fillna(Stand_cost_mean)

In [94]:
tan_2.isna().sum()
#tan_2 type :Series

0

In [102]:
#Lets convert series to DataFrame
tan_2 = tan_2.to_frame()

In [95]:
tan_3 = Transactions

In [96]:
tan_3 = tan_3.drop(['online_order','brand','product_line','product_class','product_size','standard_cost','product_first_sold_date'],axis=1)

In [98]:
tan_3.columns
#tan 3 type :DataFrame

Index(['transaction_id', 'product_id', 'customer_id', 'transaction_date',
       'order_status', 'list_price'],
      dtype='object')

In [103]:
result = pd.concat([tan_3,tan,tan_2], axis=1, sort=False)

In [105]:
result.head(3)

,transaction_id,product_id,customer_id,transaction_date,order_status,list_price,online_order,brand,product_line,product_class,product_size,standard_cost
0,1,2,2950,2017-02-25,Approved,71.49,0.0,Solex,Standard,medium,medium,53.62
1,2,3,3120,2017-05-21,Approved,2091.47,1.0,Trek Bicycles,Standard,medium,large,388.92
2,3,37,402,2017-10-16,Approved,1793.43,0.0,OHM Cycles,Standard,low,medium,248.82

In [107]:
result.shape 
# INTENSIONALLY REMOVED "product_first_sold_date" 13TH COLUMN AS IT'S NOT GIVING ANY MEANINGFULL INSIGHTS, BY THE DATA AS WELL AS FROM DOMIAN KNOWLEDGE.

(20000, 12)

In [110]:
Transactions_1 = result[["transaction_id","product_id","customer_id","transaction_date","online_order","order_status","brand","product_line","product_class","product_size","list_price","standard_cost"]]

In [111]:
Transactions_1.columns

Index(['transaction_id', 'product_id', 'customer_id', 'transaction_date',
       'online_order', 'order_status', 'brand', 'product_line',
       'product_class', 'product_size', 'list_price', 'standard_cost'],
      dtype='object')

In [112]:
Transactions.columns

Index(['transaction_id', 'product_id', 'customer_id', 'transaction_date',
       'online_order', 'order_status', 'brand', 'product_line',
       'product_class', 'product_size', 'list_price', 'standard_cost',
       'product_first_sold_date'],
      dtype='object')

In [113]:
#Lets save my final dataset i.e Transactions_1(after filling NA'S) to the local storage 
Transactions_1.to_csv('C:/Users/hp/Desktop/KPMG/MODULE_ONE/Transactions_1.csv',index=True)

All the columns appear to have consistent and correct information.

# 2. Working Only On NewCustomerList Data

In [89]:
#Reading the sheet "NewCustomerList"
NewCustomerList=pd.read_excel(open('KPMG_VI_New_raw_data_update_final (1).xlsx', 'rb'),sheet_name='NewCustomerList')

In [90]:
NewCustomerList.head(3)

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,...,QLD,Australia,6,0.71,0.8875,1.109375,0.942969,1,1,1.71875
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,...,NSW,Australia,11,0.51,0.5100,0.637500,0.541875,1,1,1.71875
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,...,VIC,Australia,5,1.05,1.0500,1.050000,1.050000,1,1,1.71875

In [91]:
#Used regex method to avoid Unnamed columns problems as seen in the above.
NewCustomerList = NewCustomerList[NewCustomerList.filter(regex='^(?!Unnamed)').columns]

In [92]:
NewCustomerList.head(5)

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,14,45 Shopko Center,4500,QLD,Australia,6,1,1.718750
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,16,14 Mccormick Park,2113,NSW,Australia,11,1,1.718750
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,10,5 Colorado Crossing,3505,VIC,Australia,5,1,1.718750
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,5,207 Annamark Plaza,4814,QLD,Australia,1,4,1.703125
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,19,115 Montana Place,2093,NSW,Australia,9,4,1.703125

In [48]:
NewCustomerList.tail(5)

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,Rank,Value
995,Ferdinand,Romanetti,Male,60,1959-10-07,Paralegal,Financial Services,Affluent Customer,N,No,9,2 Sloan Way,2200,NSW,Australia,7,996,0.374
996,Burk,Wortley,Male,22,2001-10-17,Senior Sales Associate,Health,Mass Customer,N,No,6,04 Union Crossing,2196,NSW,Australia,10,997,0.357
997,Melloney,Temby,Female,17,1954-10-05,Budget/Accounting Analyst IV,Financial Services,Affluent Customer,N,Yes,15,33475 Fair Oaks Junction,4702,QLD,Australia,2,997,0.357
998,Dickie,Cubbini,Male,30,1952-12-17,Financial Advisor,Financial Services,Mass Customer,N,Yes,19,57666 Victoria Way,4215,QLD,Australia,2,997,0.357
999,Sylas,Duffill,Male,56,1955-10-02,Staff Accountant IV,Property,Mass Customer,N,Yes,14,21875 Grover Drive,2010,NSW,Australia,9,1000,0.340

Data looks like self explanatory.

In [47]:
NewCustomerList.shape

(1000, 18)

In [49]:
NewCustomerList.columns

Index(['first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure', 'address', 'postcode', 'state', 'country',
       'property_valuation', 'Rank', 'Value'],
      dtype='object')

In [50]:
NewCustomerList.dtypes

first_name                                     object
last_name                                      object
gender                                         object
past_3_years_bike_related_purchases             int64
DOB                                    datetime64[ns]
job_title                                      object
job_industry_category                          object
wealth_segment                                 object
deceased_indicator                             object
owns_car                                       object
tenure                                          int64
address                                        object
postcode                                        int64
state                                          object
country                                        object
property_valuation                              int64
Rank                                            int64
Value                                         float64
dtype: object

In [51]:
NewCustomerList.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 18 columns):
first_name                             1000 non-null object
last_name                              971 non-null object
gender                                 1000 non-null object
past_3_years_bike_related_purchases    1000 non-null int64
DOB                                    983 non-null datetime64[ns]
job_title                              894 non-null object
job_industry_category                  835 non-null object
wealth_segment                         1000 non-null object
deceased_indicator                     1000 non-null object
owns_car                               1000 non-null object
tenure                                 1000 non-null int64
address                                1000 non-null object
postcode                               1000 non-null int64
state                                  1000 non-null object
country                                1000 non-null object
property_valuation                     1000 non-null int64
Rank                                   1000 non-null int64
Value                                  1000 non-null float64
dtypes: datetime64[ns](1), float64(1), int64(5), object(11)
memory usage: 140.8+ KB

In [52]:
NewCustomerList.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
past_3_years_bike_related_purchases,1000.0,49.836000,27.796686,0.00,26.750000,51.00,72.000,99.00000
tenure,1000.0,11.388000,5.037145,0.00,7.000000,11.00,15.000,22.00000
postcode,1000.0,3019.227000,848.895767,2000.00,2209.000000,2800.00,3845.500,4879.00000
property_valuation,1000.0,7.397000,2.758804,1.00,6.000000,8.00,9.000,12.00000
Rank,1000.0,498.819000,288.810997,1.00,250.000000,500.00,750.250,1000.00000
Value,1000.0,0.881714,0.293525,0.34,0.649531,0.86,1.075,1.71875

# Exploring Columns

In [53]:
#Explore the data further more.
NewCustomerList.job_title.unique()

array(['General Manager', 'Structural Engineer', 'Senior Cost Accountant',
       'Account Representative III', 'Financial Analyst',
       'Assistant Media Planner', 'Compensation Analyst',
       'Human Resources Assistant II', 'Speech Pathologist',
       'Accounting Assistant IV', 'Programmer Analyst I',
       'Environmental Specialist', 'Human Resources Manager',
       'VP Marketing', 'Clinical Specialist', nan, 'Associate Professor',
       'Actuary', 'Internal Auditor', 'Programmer I', 'Quality Engineer',
       'Quality Control Specialist', 'Account Executive', 'Engineer II',
       'Nurse', 'Librarian', 'Paralegal', 'Assistant Manager',
       'Senior Quality Engineer', 'Recruiting Manager', 'Design Engineer',
       'Business Systems Development Analyst', 'VP Quality Control',
       'Cost Accountant', 'Product Engineer', 'Social Worker',
       'Payment Adjustment Coordinator', 'Marketing Assistant',
       'Recruiter', 'VP Product Management', 'Media Manager III',
       'Developer I', 'Senior Financial Analyst', 'Electrical Engineer',
       'Accountant IV', 'Executive Secretary', 'Account Representative I',
       'Dental Hygienist', 'GIS Technical Architect',
       'Assistant Professor', 'Mechanical Systems Engineer',
       'Budget/Accounting Analyst IV', 'Research Nurse',
       'Computer Systems Analyst IV', 'Analyst Programmer',
       'Desktop Support Technician', 'Editor', 'Biostatistician IV',
       'Database Administrator III', 'Engineer III',
       'Physical Therapy Assistant', 'Director of Sales', 'Teacher',
       'Human Resources Assistant IV', 'Nurse Practicioner',
       'Structural Analysis Engineer', 'Marketing Manager',
       'Staff Accountant IV', 'VP Sales', 'Accountant III',
       'Sales Representative', 'Food Chemist', 'Staff Scientist',
       'Geologist IV', 'Information Systems Manager', 'Junior Executive',
       'Automation Specialist II', 'Software Consultant',
       'Civil Engineer', 'Geological Engineer', 'Graphic Designer',
       'Staff Accountant II', 'Community Outreach Specialist',
       'Programmer Analyst II', 'Pharmacist', 'Senior Editor',
       'Sales Associate', 'Developer II', 'Staff Accountant I',
       'Environmental Tech', 'Account Coordinator', 'Health Coach II',
       'Programmer Analyst III', 'Geologist III', 'Senior Developer',
       'Account Representative II', 'Help Desk Technician',
       'Research Assistant IV', 'Research Associate',
       'Computer Systems Analyst I', 'Account Representative IV',
       'Safety Technician I', 'Analog Circuit Design manager',
       'Senior Sales Associate', 'Research Assistant II',
       'Chief Design Engineer', 'Legal Assistant',
       'Occupational Therapist', 'Statistician I', 'Technical Writer',
       'Health Coach IV', 'Media Manager II', 'Professor',
       'Safety Technician II', 'Software Test Engineer IV',
       'Nuclear Power Engineer', 'Software Engineer II', 'Engineer IV',
       'Database Administrator II', 'Chemical Engineer',
       'Office Assistant II', 'Database Administrator I',
       'Research Assistant I', 'Financial Advisor',
       'Systems Administrator I', 'Systems Administrator IV', 'Operator',
       'Office Assistant I', 'Software Engineer I', 'Programmer III',
       'Media Manager I', 'Data Coordiator', 'Web Developer IV',
       'Registered Nurse', 'Media Manager IV', 'Programmer II',
       'Computer Systems Analyst II', 'Web Designer I',
       'Human Resources Assistant I', 'Help Desk Operator',
       'Systems Administrator III', 'Software Engineer III',
       'Developer IV', 'Tax Accountant', 'Automation Specialist IV',
       'VP Accounting', 'Accountant II', 'Administrative Assistant II',
       'Programmer IV', 'Web Designer IV', 'Administrative Officer',
       'Office Assistant IV', 'Accounting Assistant III',
       'Accounting Assistant I', 'Research Assistant III',
       'Web Developer II', 'Statistician III', 'Programmer Analyst IV',
       'Accountant I', 'Project Manager', 'Budget/Accounting Analyst II',
       'Automation Specialist III', 'Administrative Assistant I',
       'Engineer I', 'Health Coach III', 'Statistician II',
       'Developer III', 'Accounting Assistant II',
       'Database Administrator IV', 'Budget/Accounting Analyst III',
       'Software Test Engineer I', 'Health Coach I',
       'Safety Technician IV', 'Computer Systems Analyst III',
       'Budget/Accounting Analyst I', 'Staff Accountant III',
       'Human Resources Assistant III', 'Statistician IV',
       'Automation Specialist I', 'Systems Administrator II',
       'Software Test Engineer II', 'Software Test Engineer III',
       'Geologist I', 'Web Designer II', 'Web Developer I'], dtype=object)

In [72]:
NewCustomerList['job_title'].value_counts()

Associate Professor             15
Environmental Tech              14
Software Consultant             14
Chief Design Engineer           13
Cost Accountant                 12
                                ..
Database Administrator I         1
Software Test Engineer II        1
Web Developer II                 1
Human Resources Assistant IV     1
Budget/Accounting Analyst II     1
Name: job_title, Length: 184, dtype: int64

In [54]:
# Data contains 9 type of industry customers
NewCustomerList.job_industry_category.unique()

array(['Manufacturing', 'Property', 'Financial Services', 'Entertainment',
       'Retail', 'IT', 'Telecommunications', 'Health', nan, 'Argiculture'],
      dtype=object)

In [107]:
NewCustomerList['job_industry_category'].value_counts()

Financial Services    203
Manufacturing         199
Health                152
Retail                 78
Property               64
IT                     51
Entertainment          37
Argiculture            26
Telecommunications     25
Name: job_industry_category, dtype: int64

In [56]:
# Data devided as 3 type of wealth segmented customers
NewCustomerList.wealth_segment.unique()

array(['Mass Customer', 'Affluent Customer', 'High Net Worth'],
      dtype=object)

In [108]:
NewCustomerList['wealth_segment'].value_counts()
#Affluent consumers perceive themselves as important, valuable customers, and they expect to be recognized and treated as such at every point in the customer lifecycle.

Mass Customer        508
High Net Worth       251
Affluent Customer    241
Name: wealth_segment, dtype: int64

In [58]:
# Data contains 3 state customer details
NewCustomerList.state.unique()

array(['QLD', 'NSW', 'VIC'], dtype=object)

In [109]:
NewCustomerList['state'].value_counts()

NSW    506
VIC    266
QLD    228
Name: state, dtype: int64

In [57]:
# The dataset Belongs to Australia
NewCustomerList.country.unique()

array(['Australia'], dtype=object)

In [61]:
# The dataset has only Healthiest persons data
NewCustomerList.deceased_indicator.unique()

array(['N'], dtype=object)

In [62]:
# The company has 3type of genders as their customers
NewCustomerList.gender.unique()

array(['Male', 'Female', 'U'], dtype=object)

In [63]:
# Data has both car owners and not car owners
NewCustomerList.owns_car.unique()

array(['Yes', 'No'], dtype=object)

In [112]:
NewCustomerList['owns_car'].value_counts()

No     507
Yes    493
Name: owns_car, dtype: int64

In [73]:
NewCustomerList['gender'].value_counts()

Female    513
Male      470
U          17
Name: gender, dtype: int64

In [103]:
# Lets Replace 'U' with 'Unspecified'
NewCustomerList['gender'] = NewCustomerList['gender'].replace({'Female':'Female','Male':'Male','U':'Unspecified'})

In [104]:
NewCustomerList['gender'].value_counts()

Female         513
Male           470
Unspecified     17
Name: gender, dtype: int64

In [105]:
NewCustomerList['DOB'].describe()

count                     983
unique                    958
top       1961-07-31 00:00:00
freq                        2
first     1938-06-08 00:00:00
last      2002-02-27 00:00:00
Name: DOB, dtype: object

In [113]:
def is_unique(s):
    a= s.to_numpy()
    return (a[0] == a[1:].all())
is_unique(NewCustomerList['address']) 
# Address is not Unique , Possible, two person from the same house or from same PG may have purchased from the same company

False

# Exploring Missing Values

In [114]:
NewCustomerList.isna().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Rank                                     0
Value                                    0
dtype: int64

Looks tricky a bit, 
last_name : There may be a chance that people donot have there last name, DOB : We cant able to fill the DOB and We cant even drop them, If our business logic not depends on DOB,
job_title and job_industry_category : Again its depended on business logic,
All the numeric columns looks fine

# Checking For Duplicate Values

In [115]:
duplicates = NewCustomerList.duplicated()
NewCustomerList[duplicates].sum()

first_name                             0.0
last_name                              0.0
gender                                 0.0
past_3_years_bike_related_purchases    0.0
DOB                                    0.0
job_title                              0.0
job_industry_category                  0.0
wealth_segment                         0.0
deceased_indicator                     0.0
owns_car                               0.0
tenure                                 0.0
address                                0.0
postcode                               0.0
state                                  0.0
country                                0.0
property_valuation                     0.0
Rank                                   0.0
Value                                  0.0
dtype: float64

Data looks fine, No duplicates

In [117]:
#Lets save my final dataset i.e NewCustomerList to the local storage 
NewCustomerList.to_csv('C:/Users/hp/Desktop/KPMG/MODULE_ONE/NewCustomerListsAftEda_1.csv',index=True)

# 3. Working Only On CustomerDemographic Data

In [118]:
#Reading the sheet "CustomerDemographic"
CustomerDemographic=pd.read_excel(open('KPMG_VI_New_raw_data_update_final (1).xlsx', 'rb'),
              sheet_name='CustomerDemographic')

in CustomerDemographic an attribute called "default",  has no meaning so i dropped it directly.

In [119]:
CustomerDemographic.head(5)

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,Yes,8.0

In [120]:
CustomerDemographic.tail(5)

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
3995,3996,Rosalia,Halgarth,Female,8,1975-08-09,VP Product Management,Health,Mass Customer,N,No,19.0
3996,3997,Blanch,Nisuis,Female,87,2001-07-13,Statistician II,Manufacturing,High Net Worth,N,Yes,1.0
3997,3998,Sarene,Woolley,U,60,NaT,Assistant Manager,IT,High Net Worth,N,No,NaN
3998,3999,Patrizius,NaN,Male,11,1973-10-24,NaN,Manufacturing,Affluent Customer,N,Yes,10.0
3999,4000,Kippy,Oldland,Male,76,1991-11-05,Software Engineer IV,NaN,Affluent Customer,N,No,11.0

In [121]:
CustomerDemographic.shape

(4000, 12)

In [122]:
CustomerDemographic.columns

Index(['customer_id', 'first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure'],
      dtype='object')

In [123]:
CustomerDemographic.dtypes

customer_id                                     int64
first_name                                     object
last_name                                      object
gender                                         object
past_3_years_bike_related_purchases             int64
DOB                                    datetime64[ns]
job_title                                      object
job_industry_category                          object
wealth_segment                                 object
deceased_indicator                             object
owns_car                                       object
tenure                                        float64
dtype: object

In [124]:
CustomerDemographic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 12 columns):
customer_id                            4000 non-null int64
first_name                             4000 non-null object
last_name                              3875 non-null object
gender                                 4000 non-null object
past_3_years_bike_related_purchases    4000 non-null int64
DOB                                    3913 non-null datetime64[ns]
job_title                              3494 non-null object
job_industry_category                  3344 non-null object
wealth_segment                         4000 non-null object
deceased_indicator                     4000 non-null object
owns_car                               4000 non-null object
tenure                                 3913 non-null float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(8)
memory usage: 375.1+ KB

In [125]:
CustomerDemographic.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
customer_id,4000.0,2000.500000,1154.844867,1.0,1000.75,2000.5,3000.25,4000.0
past_3_years_bike_related_purchases,4000.0,48.890000,28.715005,0.0,24.00,48.0,73.00,99.0
tenure,3913.0,10.657041,5.660146,1.0,6.00,11.0,15.00,22.0

# Exploring Columns

In [127]:
CustomerDemographic["gender"].unique()

array(['F', 'Male', 'Female', 'U', 'Femal', 'M'], dtype=object)

In [128]:
CustomerDemographic["gender"].value_counts()

Female    2037
Male      1872
U           88
Femal        1
M            1
F            1
Name: gender, dtype: int64

In [133]:
# Lets Replace 'U' with 'Unspecified' Female,F with Female and M with male
CustomerDemographic['gender'] = CustomerDemographic['gender'].replace({'Female':'Female','Male':'Male','U':'Unspecified','Femal':'Female','M':'Male','F':'Female'})

In [135]:
CustomerDemographic['gender'].value_counts()

Female         2039
Male           1873
Unspecified      88
Name: gender, dtype: int64

In [136]:
CustomerDemographic['DOB'].describe()

count                    3913
unique                   3448
top       1978-01-30 00:00:00
freq                        7
first     1843-12-21 00:00:00
last      2002-03-11 00:00:00
Name: DOB, dtype: object

In [138]:
CustomerDemographic['job_title'].unique()

array(['Executive Secretary', 'Administrative Officer',
       'Recruiting Manager', nan, 'Senior Editor', 'Media Manager I',
       'Business Systems Development Analyst', 'Senior Quality Engineer',
       'Nuclear Power Engineer', 'Developer I', 'Account Executive',
       'Junior Executive', 'Media Manager IV', 'Sales Associate',
       'Professor', 'Geological Engineer', 'Project Manager',
       'Safety Technician I', 'Research Assistant I',
       'Accounting Assistant III', 'Editor', 'Research Nurse',
       'Safety Technician III', 'Staff Accountant III', 'Legal Assistant',
       'Product Engineer', 'Information Systems Manager',
       'VP Quality Control', 'Social Worker', 'Senior Cost Accountant',
       'Assistant Media Planner', 'Payment Adjustment Coordinator',
       'Food Chemist', 'Accountant III', 'Director of Sales',
       'Senior Financial Analyst', 'Registered Nurse',
       'Biostatistician II', 'Computer Systems Analyst II',
       'Software Test Engineer II', 'Paralegal', 'VP Sales',
       'Chief Design Engineer', 'Office Assistant III',
       'Physical Therapy Assistant', 'Help Desk Operator',
       'Web Developer II', 'Research Associate', 'Teacher',
       'VP Product Management', 'Statistician II',
       'Automation Specialist IV', 'Data Coordiator',
       'Software Test Engineer III', 'Internal Auditor',
       'Analyst Programmer', 'Occupational Therapist',
       'Speech Pathologist', 'Quality Control Specialist',
       'Civil Engineer', 'Software Engineer III',
       'Community Outreach Specialist', 'Safety Technician IV',
       'VP Accounting', 'General Manager', 'Nurse Practicioner',
       'Automation Specialist II', 'Marketing Assistant',
       'Marketing Manager', 'Staff Scientist', 'Assistant Professor',
       'Budget/Accounting Analyst IV', 'Associate Professor',
       'Graphic Designer', 'Administrative Assistant II',
       'Compensation Analyst', 'Systems Administrator III',
       'Financial Advisor', 'Chemical Engineer', 'Web Designer I',
       'Senior Developer', 'Office Assistant II', 'Recruiter', 'Operator',
       'Programmer Analyst III', 'Quality Engineer', 'Environmental Tech',
       'Analog Circuit Design manager', 'Cost Accountant', 'Librarian',
       'Structural Analysis Engineer', 'Pharmacist', 'Assistant Manager',
       'Accountant I', 'Web Designer III', 'Geologist III',
       'Software Test Engineer I', 'Structural Engineer',
       'Safety Technician II', 'Web Developer III',
       'Programmer Analyst II', 'Design Engineer', 'Statistician I',
       'VP Marketing', 'Desktop Support Technician', 'Actuary',
       'Database Administrator III', 'Electrical Engineer',
       'Tax Accountant', 'Clinical Specialist',
       'Database Administrator IV', 'Systems Administrator II',
       'Account Coordinator', 'Programmer III',
       'Administrative Assistant III', 'Nurse', 'Technical Writer',
       'Staff Accountant II', 'Dental Hygienist', 'Sales Representative',
       'Budget/Accounting Analyst III', 'Computer Systems Analyst IV',
       'Geologist I', 'Financial Analyst', 'Accounting Assistant II',
       'Senior Sales Associate', 'Database Administrator II',
       'Engineer I', 'Budget/Accounting Analyst I', 'Developer IV',
       'Database Administrator I', 'Environmental Specialist',
       'Computer Systems Analyst I', 'Account Representative IV',
       'Statistician IV', 'Human Resources Manager',
       'GIS Technical Architect', 'Programmer IV',
       'Accounting Assistant IV', 'Software Engineer IV', 'Programmer II',
       'Engineer III', 'Software Consultant', 'Biostatistician IV',
       'Help Desk Technician', 'Automation Specialist I', 'Developer III',
       'Human Resources Assistant I', 'Geologist IV', 'Media Manager II',
       'Statistician III', 'Engineer II', 'Health Coach II',
       'Developer II', 'Systems Administrator I', 'Web Developer I',
       'Software Engineer II', 'Accounting Assistant I',
       'Research Assistant II', 'Programmer Analyst IV', 'Health Coach I',
       'Accountant II', 'Automation Specialist III',
       'Administrative Assistant I', 'Health Coach IV',
       'Media Manager III', 'Account Representative III',
       'Web Designer IV', 'Budget/Accounting Analyst II',
       'Web Developer IV', 'Programmer I', 'Biostatistician III',
       'Software Test Engineer IV', 'Research Assistant IV',
       'Account Representative I', 'Accountant IV', 'Biostatistician I',
       'Human Resources Assistant IV', 'Administrative Assistant IV',
       'Office Assistant I', 'Human Resources Assistant II',
       'Mechanical Systems Engineer', 'Engineer IV', 'Health Coach III',
       'Office Assistant IV', 'Software Engineer I',
       'Human Resources Assistant III', 'Staff Accountant I',
       'Computer Systems Analyst III', 'Geologist II', 'Web Designer II',
       'Staff Accountant IV', 'Account Representative II',
       'Programmer Analyst I', 'Systems Administrator IV',
       'Research Assistant III'], dtype=object)

In [139]:
CustomerDemographic['job_title'].value_counts()

Business Systems Development Analyst    45
Social Worker                           44
Tax Accountant                          44
Internal Auditor                        42
Recruiting Manager                      41
                                        ..
Human Resources Assistant IV             4
Health Coach I                           3
Health Coach III                         3
Research Assistant III                   3
Developer I                              1
Name: job_title, Length: 195, dtype: int64

In [140]:
CustomerDemographic['job_industry_category'].unique()

array(['Health', 'Financial Services', 'Property', 'IT', nan, 'Retail',
       'Argiculture', 'Manufacturing', 'Telecommunications',
       'Entertainment'], dtype=object)

In [141]:
CustomerDemographic['job_industry_category'].value_counts()

Manufacturing         799
Financial Services    774
Health                602
Retail                358
Property              267
IT                    223
Entertainment         136
Argiculture           113
Telecommunications     72
Name: job_industry_category, dtype: int64

In [142]:
CustomerDemographic['wealth_segment'].unique()

array(['Mass Customer', 'Affluent Customer', 'High Net Worth'],
      dtype=object)

In [144]:
CustomerDemographic['wealth_segment'].value_counts()

Mass Customer        2000
High Net Worth       1021
Affluent Customer     979
Name: wealth_segment, dtype: int64

In [145]:
#This CustomerDemographic data contains both deceased persons and healthy persons data but its abscemt in NewCustomerList
CustomerDemographic['deceased_indicator'].unique()

array(['N', 'Y'], dtype=object)

In [146]:
CustomerDemographic['deceased_indicator'].value_counts()

N    3998
Y       2
Name: deceased_indicator, dtype: int64

In [147]:
CustomerDemographic['owns_car'].unique()

array(['Yes', 'No'], dtype=object)

In [149]:
CustomerDemographic['owns_car'].value_counts()

Yes    2024
No     1976
Name: owns_car, dtype: int64

# Exploring Missing Values

In [154]:
CustomerDemographic.isna().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                  87
dtype: int64

Same goes to the Customer Demographic dataset as in NewCustomerList, inorder fill the missing values or drop the rows is totally dependent on the business logic

# Checking For Duplicate Values

In [155]:
duplicates = CustomerDemographic.duplicated()
CustomerDemographic[duplicates].sum()

customer_id                            0.0
first_name                             0.0
last_name                              0.0
gender                                 0.0
past_3_years_bike_related_purchases    0.0
DOB                                    0.0
job_title                              0.0
job_industry_category                  0.0
wealth_segment                         0.0
deceased_indicator                     0.0
owns_car                               0.0
tenure                                 0.0
dtype: float64

In [158]:
CustomerDemographic.to_csv('C:/Users/hp/Desktop/KPMG/MODULE_ONE/CustomerDemographicAftEda_1.csv',index=True)

# 4. Lets see CustomerAddress Data also

In [160]:
#Reading the sheet "CustomerAddress"
CustomerAddress=pd.read_excel(open('KPMG_VI_New_raw_data_update_final (1).xlsx', 'rb'),
              sheet_name='CustomerAddress')

In [161]:
CustomerAddress.head(5)

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [162]:
CustomerAddress.tail(5)

,customer_id,address,postcode,state,country,property_valuation
3994,3999,1482 Hauk Trail,3064,VIC,Australia,3
3995,4000,57042 Village Green Point,4511,QLD,Australia,6
3996,4001,87 Crescent Oaks Alley,2756,NSW,Australia,10
3997,4002,8194 Lien Street,4032,QLD,Australia,7
3998,4003,320 Acker Drive,2251,NSW,Australia,7

Its looks like its definetaly missing part of the CustomerDemographic dataset

# Lets Merge all customer information from the last three tables into one

Two of the dataset contains same values, Its better to merge them into one

In [163]:
NewCustomerList.head()

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,14,45 Shopko Center,4500,QLD,Australia,6,1,1.718750
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,16,14 Mccormick Park,2113,NSW,Australia,11,1,1.718750
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,10,5 Colorado Crossing,3505,VIC,Australia,5,1,1.718750
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,5,207 Annamark Plaza,4814,QLD,Australia,1,4,1.703125
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,19,115 Montana Place,2093,NSW,Australia,9,4,1.703125

In [166]:
CustomerDemographic.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
0,1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,Yes,8.0

In [164]:
CustomerDemographic['customer_id'].iloc[-1]

4000

Lets add 'Customer Id' column to NewCustomerList to enable us merge the tables vertically

In [167]:
NewCustomerList.insert(0, 'customer_id', range(4001, 4001 + len(NewCustomerList)))

In [168]:
NewCustomerList.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,Rank,Value
0,4001,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,14,45 Shopko Center,4500,QLD,Australia,6,1,1.718750
1,4002,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,16,14 Mccormick Park,2113,NSW,Australia,11,1,1.718750
2,4003,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,10,5 Colorado Crossing,3505,VIC,Australia,5,1,1.718750
3,4004,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,5,207 Annamark Plaza,4814,QLD,Australia,1,4,1.703125
4,4005,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,19,115 Montana Place,2093,NSW,Australia,9,4,1.703125

In [169]:
NewCustomerList.tail()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,Rank,Value
995,4996,Ferdinand,Romanetti,Male,60,1959-10-07,Paralegal,Financial Services,Affluent Customer,N,No,9,2 Sloan Way,2200,NSW,Australia,7,996,0.374
996,4997,Burk,Wortley,Male,22,2001-10-17,Senior Sales Associate,Health,Mass Customer,N,No,6,04 Union Crossing,2196,NSW,Australia,10,997,0.357
997,4998,Melloney,Temby,Female,17,1954-10-05,Budget/Accounting Analyst IV,Financial Services,Affluent Customer,N,Yes,15,33475 Fair Oaks Junction,4702,QLD,Australia,2,997,0.357
998,4999,Dickie,Cubbini,Male,30,1952-12-17,Financial Advisor,Financial Services,Mass Customer,N,Yes,19,57666 Victoria Way,4215,QLD,Australia,2,997,0.357
999,5000,Sylas,Duffill,Male,56,1955-10-02,Staff Accountant IV,Property,Mass Customer,N,Yes,14,21875 Grover Drive,2010,NSW,Australia,9,1000,0.340

In [170]:
CustomerDemographic.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
0,1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,Yes,8.0

Inorder to merge CustomerDemographic with the NewCustomer list we have to add all these attributes (address,postcode,state,country,property_valuation,Rank,Value)
These attributes are in the 4th dataset CustomerAddress.

In [171]:
CustomerAddress.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [172]:
# CustomerAddress is merged with the CustomerDemographic on to the left
CustomerDemographic = pd.merge(CustomerDemographic, CustomerAddress, how='left', on='customer_id')

In [174]:
CustomerDemographic.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation
0,1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0,060 Morning Avenue,2016.0,New South Wales,Australia,10.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0,6 Meadow Vale Court,2153.0,New South Wales,Australia,10.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.0,NaN,NaN,NaN,NaN,NaN
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,No,7.0,0 Holy Cross Court,4211.0,QLD,Australia,9.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,Yes,8.0,17979 Del Mar Point,2448.0,New South Wales,Australia,4.0

In [175]:
CustomerDemographic.shape

(4000, 17)

In [176]:
NewCustomerList.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,Rank,Value
0,4001,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,14,45 Shopko Center,4500,QLD,Australia,6,1,1.718750
1,4002,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,16,14 Mccormick Park,2113,NSW,Australia,11,1,1.718750
2,4003,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,10,5 Colorado Crossing,3505,VIC,Australia,5,1,1.718750
3,4004,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,5,207 Annamark Plaza,4814,QLD,Australia,1,4,1.703125
4,4005,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,19,115 Montana Place,2093,NSW,Australia,9,4,1.703125

In [177]:
#Lets not use the index values along the concatenation axis
Concatenated_New_Data = pd.concat([CustomerDemographic, NewCustomerList], ignore_index=True, sort=False)

In [178]:
Concatenated_New_Data

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,Rank,Value
0,1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0,060 Morning Avenue,2016.0,New South Wales,Australia,10.0,NaN,NaN
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0,6 Meadow Vale Court,2153.0,New South Wales,Australia,10.0,NaN,NaN
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,No,7.0,0 Holy Cross Court,4211.0,QLD,Australia,9.0,NaN,NaN
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,Yes,8.0,17979 Del Mar Point,2448.0,New South Wales,Australia,4.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4995,4996,Ferdinand,Romanetti,Male,60,1959-10-07,Paralegal,Financial Services,Affluent Customer,N,No,9.0,2 Sloan Way,2200.0,NSW,Australia,7.0,996.0,0.374
4996,4997,Burk,Wortley,Male,22,2001-10-17,Senior Sales Associate,Health,Mass Customer,N,No,6.0,04 Union Crossing,2196.0,NSW,Australia,10.0,997.0,0.357
4997,4998,Melloney,Temby,Female,17,1954-10-05,Budget/Accounting Analyst IV,Financial Services,Affluent Customer,N,Yes,15.0,33475 Fair Oaks Junction,4702.0,QLD,Australia,2.0,997.0,0.357
4998,4999,Dickie,Cubbini,Male,30,1952-12-17,Financial Advisor,Financial Services,Mass Customer,N,Yes,19.0,57666 Victoria Way,4215.0,QLD,Australia,2.0,997.0,0.357
4999,5000,Sylas,Duffill,Male,56,1955-10-02,Staff Accountant IV,Property,Mass Customer,N,Yes,14.0,21875 Grover Drive,2010.0,NSW,Australia,9.0,1000.0,0.340

In [179]:
#Rename df by assigning it to original,

CustomerDemographic = Concatenated_New_Data

In [180]:
CustomerDemographic

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,Rank,Value
0,1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0,060 Morning Avenue,2016.0,New South Wales,Australia,10.0,NaN,NaN
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0,6 Meadow Vale Court,2153.0,New South Wales,Australia,10.0,NaN,NaN
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,No,7.0,0 Holy Cross Court,4211.0,QLD,Australia,9.0,NaN,NaN
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,Yes,8.0,17979 Del Mar Point,2448.0,New South Wales,Australia,4.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4995,4996,Ferdinand,Romanetti,Male,60,1959-10-07,Paralegal,Financial Services,Affluent Customer,N,No,9.0,2 Sloan Way,2200.0,NSW,Australia,7.0,996.0,0.374
4996,4997,Burk,Wortley,Male,22,2001-10-17,Senior Sales Associate,Health,Mass Customer,N,No,6.0,04 Union Crossing,2196.0,NSW,Australia,10.0,997.0,0.357
4997,4998,Melloney,Temby,Female,17,1954-10-05,Budget/Accounting Analyst IV,Financial Services,Affluent Customer,N,Yes,15.0,33475 Fair Oaks Junction,4702.0,QLD,Australia,2.0,997.0,0.357
4998,4999,Dickie,Cubbini,Male,30,1952-12-17,Financial Advisor,Financial Services,Mass Customer,N,Yes,19.0,57666 Victoria Way,4215.0,QLD,Australia,2.0,997.0,0.357
4999,5000,Sylas,Duffill,Male,56,1955-10-02,Staff Accountant IV,Property,Mass Customer,N,Yes,14.0,21875 Grover Drive,2010.0,NSW,Australia,9.0,1000.0,0.340

In [181]:
CustomerDemographic.to_csv('C:/Users/hp/Desktop/KPMG/MODULE_ONE/CustomerDemographicFinal.csv',index=True)

In [3]:
CustomerDemographic = pd.read_csv('CustomerDemographicFinal.csv')

In [4]:
CustomerDemographic.isna().sum()

Unnamed: 0                                0
customer_id                               0
first_name                                0
last_name                               154
gender                                    0
past_3_years_bike_related_purchases       0
DOB                                     104
job_title                               612
job_industry_category                   821
wealth_segment                            0
deceased_indicator                        0
owns_car                                  0
tenure                                   87
address                                   4
postcode                                  4
state                                     4
country                                   4
property_valuation                        4
Rank                                   4000
Value                                  4000
dtype: int64

In [5]:
duplicates = CustomerDemographic.duplicated()
CustomerDemographic[duplicates].sum()

Unnamed: 0                             0.0
customer_id                            0.0
first_name                             0.0
last_name                              0.0
gender                                 0.0
past_3_years_bike_related_purchases    0.0
DOB                                    0.0
job_title                              0.0
job_industry_category                  0.0
wealth_segment                         0.0
deceased_indicator                     0.0
owns_car                               0.0
tenure                                 0.0
address                                0.0
postcode                               0.0
state                                  0.0
country                                0.0
property_valuation                     0.0
Rank                                   0.0
Value                                  0.0
dtype: float64